app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

    def create
      @post = Post.create!(post_params.merge(user: current_user))
---
INSERT INTO "posts" ("caption", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "caption" = $1, "image_file_name" = $2, "image_file_size" = $3, "image_updated_at" = $4, "updated_at" = $5 WHERE "posts"."id" = $6